"""
Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |
"""
n = input("Введите 3-х значное число  ")
if len(n) != 3:
    print("Введено не 3-х значное число")
    exit()
else:
    result = 0
for i in range(len(n)):
    result = result + int(n[i])
i = +1
print(f"{n} ->  {result} ({n[0]} + {n[1]} + {n[2]}) ")
#print(f"{n} ->  {int(n[0]) + int(n[1]) + int(n[2])} ({n[0]} + {n[1]} + {n[2]} ) ")
